In [1]:
import numpy as np
import pandas 
import pandas as pd
#1 Загрузите выборку из файла titanic.csv с помощью пакета Pandas.
data = pandas.read_csv('titanic.csv', index_col='PassengerId')
data[:2]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [2]:
#2 Оставьте в выборке четыре признака: 
#класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).
#data1 = data[['Pclass','Fare','Age','Sex']]
#data1[:2]

data2 = data.loc[:,'Pclass':'Fare']
data2 = data2.drop('Name', axis=1)
data2 = data2.drop('SibSp', axis=1)
data2 = data2.drop('Parch', axis=1)
data2 = data2.drop('Ticket', axis=1)
data2[:2]

             Pclass     Sex   Age     Fare
PassengerId
1                 3    male  22.0   7.2500
2                 1  female  38.0  71.2833

In [3]:
# 3 Обратите внимание, что признак Sex имеет строковые значения.
#df['B'] = df1['E'].values
#w = data1.loc[:,'Sex']
#w[:2]
#w.replace(['male', 'female'], [1, 0], inplace=True)
data2.replace(['male', 'female'], [1, 0], inplace=True)

In [4]:
data2[:8]

             Pclass  Sex   Age     Fare
PassengerId
1                 3    1  22.0   7.2500
2                 1    0  38.0  71.2833
3                 3    0  26.0   7.9250
4                 1    0  35.0  53.1000
5                 3    1  35.0   8.0500
6                 3    1   NaN   8.4583
7                 1    1  54.0  51.8625
8                 3    1   2.0  21.0750

In [37]:
# 4 Выделите целевую переменную — она записана в столбце Survived.

             Pclass  Sex   Age     Fare
PassengerId
1                 3    1  22.0   7.2500
2                 1    0  38.0  71.2833
3                 3    0  26.0   7.9250
4                 1    0  35.0  53.1000
5                 3    1  35.0   8.0500
6                 3    1   NaN   8.4583
7                 1    1  54.0  51.8625
8                 3    1   2.0  21.0750

In [35]:
# 5 В данных есть пропущенные значения — например, для некоторых пассажиров неизвестен их возраст.
# Такие записи при чтении их в pandas принимают значение nan. 
# Найдите все объекты, у которых есть пропущенные признаки, и удалите их из выборки
data3 = data2[np.isfinite(data2['Age'])]
data3[:7]

             Pclass  Sex   Age     Fare
PassengerId
1                 3    1  22.0   7.2500
2                 1    0  38.0  71.2833
3                 3    0  26.0   7.9250
4                 1    0  35.0  53.1000
5                 3    1  35.0   8.0500
7                 1    1  54.0  51.8625
8                 3    1   2.0  21.0750